#include <stdio.h>
#define N 3 //γραμμες
#define M 4 //στηλες

int main(void){
	system("chcp 1253>nul");
	int pin[N][M];
	
	int i,j,k=0,l=0;
	int *ptr = &pin[0][0];
	printf("Δώσε το στοιχείο [0][0]: ");
	scanf("%d",&pin[0][0]);
	
	//χειριζόμαστε τον πίνακα σαν μονοδιαστατο (όπως είναι στη μνήμη), για να
	//ελεγξουμε πιο έυκολα προς τα πίσω για διπλοεγγραφες
	for(i=1;i<N*M;++i){			
	
		printf("Δώσε το στοιχείο [%d][%d]: ", i / M, i % M); //για σωστό αριθμο γραμμης-στήλης
		scanf("%d",ptr+i); //μετακίνουμε τον δείκτη +i
		
		//Έλεγχος διπλοεγγραφής
		for (j=0;j<i;++j){
			if(*(ptr+i)==*(ptr+j)){ 
				printf("Η τιμή %d έχει ήδη εισαχθεί.\n", *(ptr + i));
				i--;
				break;
			}			
							
	
		}	
	}
	// Εκτύπωση του πίνακα γ
    printf("\nΟ πίνακας που δώσατε είναι:\n");
    for (i=0; i<N; ++i) {
        for (j=0; j<M; ++j) {
            printf("%2d ", pin[i][j]);
        }
        printf("\n");
    }
	return 0;
}
