

#include <stdio.h>
#include <stdlib.h>
#define SIZE 10

int main(void) {
    system("chcp 1253>nul");  // Κωδικοποίηση Χαρακτήρων για Ελληνικά

    size_t i;
    int pin[SIZE];
    char term;  //Δημιουργείται μια μεταβλητή term τύπου χαρακτήρα,
	// η οποία θα χρησιμοποιηθεί για να διαβάσει τον χαρακτήρα που ακολουθεί τον αριθμό που δίνει ο χρήστης.

    i = 0;  // Αρχικοποίηση Μετρητή
    while (i < SIZE) {
        printf("Δώστε το στοιχείο %d: ", i + 1);
        
        
        

        // Έλεγχος αν ο αριθμός είναι ακέραιος
        if (scanf("%d%c", &pin[i], &term) != 2 || term != '\n' ){  /* Ελεγχος αν δωθηκε ακεραιος και κενος χαρατκηρας     */
     	
        	
            // Εάν η είσοδος δεν είναι ακέραιος
            printf("Μη έγκυρος ακέραιος, παρακαλώ προσπαθήστε ξανά.\n");
            
            // Καθαρισμός του input buffer
            while (getchar() != '\n');
            
        } else {
            // Εάν η είσοδος είναι ακέραιος
            
            
            // Αύξηση του μετρητή
            i = i + 1;
        }
    }

   



//ΕΚΤΥΠΩΣΗ ΠΙΝΑΚΑ
	puts("\nΟ πίνακας που εισαγάγατε:");
	for (i=0;i<SIZE;++i){
		printf("[%d]  ",pin[i]);
		
	}
 return 0;
}



