#include <stdio.h>

// Ελεγχος αν είναι δυαδικό
int isBinary(long long int  num) {
    while (num > 0) {
        int digit = num % 10;
        if (digit != 0 && digit != 1) {
            return 0; // όχι δυαδικό
        }
        num /= 10;
    }
    return 1; // ειναι δυαδικό
}



//Μετατροπή σε 16diκό 
void binarytohex(long long int x){
	int i,count=0;
	char pin[100];
	int temp,pows;
	while (x>0){ //όσο υπάρχουν ψηφία (αφου μειώνουμε συνεχώς χ/10)
		temp=0;  //τετραδα δυαδικών ψηφίων αρχικοποίηση
		pows=1;  //δύναμη του 2
		  
		for (i=0;i<4;++i){ //φτιάχνουμε τον δεκαδικό της τετράδας δυαδικών
			
			temp+=(x%10)*pows;  //παίρνουμε από το τέλος προς την αρχή
			pows*=2;            //αυξάνουμε τη δύναμη του 2 px
			                    // 1101 = 1 * 2^0 + 0 * 2^1 + 1 * 2^2 + 1*2^3 =13
			x=x/10;             //μειώνουμε τον αριθμο κατα ενα ψηφίο
			
		}
	
	// μετατροπή σε 16αδικό χαρακτήρα
    	if (temp < 10) {
        pin[count++] = temp + '0';  // 0-9 -> '0'-'9' //βρίσκουμε την απόσταση 
			//των αριθμων ως χαρακτήρες
    	} else {
        pin[count++] = temp - 10 + 'A';  // 10-15 -> 'A'-'F'
            //βρίσκουμε την απόσταση από το A αφου αφαιρέσουμε 10
            //πχ 11-10=1 ==> 'Β' , απέχει 1 απο Α
        }
	}
	
	if (count>99) {
		printf("Πολύ μεγάλος αριθμός! Μήπως το παράκανες;");
		
	}else {
		puts("Δεκαεξαδικός:");
		
		for(i=count-1;i>=0;--i){     //τυπώνουμε με αντίστροφη σειρά τον οκταδικο
		
			printf("%c",pin[i]);     //αφού υπολογίσαμε τις τριάδες από το τέλος προς την αρχή
		}
	}

		
}


int main(void){
	system("chcp 1253>nul");
	
	int i, pin[8],valid;
	long long int num;  //για να μετατρέπουμε και μεγαλύτερα δυαδικα
	puts(" Μετατροπή Δυαδικού σε 16δικό αριθμό");
	puts("---------------------------------------");
	do{
		printf("Δώσε θετικό ακέραιο δυαδικό αριθμό: ");
		scanf("%lld",&num);
		if(isBinary(num)==0) puts("Δώσε δυαδικό αριθμό μόνο!");
	
	}while (isBinary(num)==0);
	
	
	
	//Κλήση συναρτήσεων
	binarytohex(num);
	return 0;
}
