#include <stdio.h>

// Ελεγχος αν είναι δυαδικό
int isBinary(int num) {
    while (num > 0) {
        int digit = num % 10;
        if (digit != 0 && digit != 1) {
            return 0; // όχι δυαδικό
        }
        num /= 10;
    }
    return 1; // ειναι δυαδικό
}


//Μετατροπή σε οκταδικό 
void binarytoOctal(int x){
	int i, pin[100],count=0;
	int temp,pows;
	while (x>0){ //όσο υπάρχουν ψηφία (αφου μειώνουμε συνεχώς χ/10)
		temp=0;  //τριάδα δυαδικών ψηφίων αρχικοποίηση
		pows=1;  //δύναμη του 2
		  
		for (i=0;i<3;++i){ //φτιάχνουμε τον δεκαδικό της τριάδας δυαδικών
			
			temp+=(x%10)*pows;  //παίρνουμε από το τέλος προς την αρχή
			pows*=2;            //αυξάνουμε τη δύναμη του 2 px
			                    // 101 = 1 * 2^0 + 0 * 2^1 + 1 * 2^2 =5
			x=x/10;             //μειώνουμε τον αριθμο κατα ενα ψηφίο
			
		}
	   
	    pin[count++]=temp;     //βάζουμε τον αντίστοιχο δεκαδικό της τριάδας σε έναν πίνακα
	    					   //με μετρητή για να ξέρουμε πόσα ψηφία 8dikoυ βρήκαμε
		   	  
				  
	}
	if (count>99) {
		printf("Πολύ μεγάλος αριθμός! Μήπως το παράκανες;");
		
	}else {
		puts("ΟΚΤΑΔΙΚΟΣ:");
		
		for(i=count-1;i>=0;--i){     //τυπώνουμε με αντίστροφη σειρά τον οκταδικο
		
			printf("%d",pin[i]);     //αφού υπολογίσαμε τις τριάδες από το τέλος προς την αρχή
		}
	}

		
}


int main(void){
	system("chcp 1253>nul");
	
	int i, num, pin[8],valid;
	puts(" Μετατροπή Δυαδικού σε οκταδικό αριθμό");
	puts("---------------------------------------");
	do{
		printf("Δώσε θετικό ακέραιο δυαδικό αριθμό: ");
		scanf("%d",&num);
		if(isBinary(num)==0) puts("Δώσε δυαδικό αριθμό μόνο!");
	
	}while (isBinary(num)==0);
	
	
	
	//Κλήση συναρτήσεων
	binarytoOctal(num);
	return 0;
}
