#include <stdio.h>
#include <stdlib.h>


void sum_oct(int a[], int b[], int n) {
	int i;
	int c[n+1];//πίνακας αποτελεσματος, προσθέτομε αλλο ενα κελί στην 
			   //αρχή για τυχόν κρατούμενο
	c[0]=0;    //αρχικοποίηση κρατούμενου
	int sum,kratoum=0;
	for(i=n-1;i>=0;--i){
		sum=a[i]+b[i]+kratoum;   // προσθέτουμε τα ψηφία ανα 2 + οτι κρατούμενο υπάρχει (αν υπάρχει)
		c[i+1]=sum%8;            //αυτό που μένει, πχ 2+6=0(ή 8 %8), 5+4=1 και 1 κρατούμενο (ή 9%8)
		kratoum=sum/8;           //ακέραια διαιρεση με 8, ότι περισσέυει γίνεται κρατούμενο (μοναδα)
		
	}
	//αν έχουντας τελειώσει την πρόσθεση υπάρχει κρατούμενο, το προσθέτουμε μπροστά
	if (kratoum!=0){
		c[0]=kratoum;
	}
	

	puts("\nΑποτέλεσμα: ");
	
	for(i=0;i<n+1;++i){
		printf("%d ",c[i]);
	}
	
	
	
}
	


int main(void){
	
	system("chcp 1253>nul");
	int a[4]={0,1,7,7};
	int b[4]={0,6,5,5};
	int i;
	puts("Αριθμοί: ");
	printf("  ");
	for(i=0;i<4;++i){
		printf("%d ",a[i]);
	}
	printf("\n+\n");
	printf("  ");
	for(i=0;i<4;++i){
		printf("%d ",b[i]);
	}
	
	sum_oct(a,b,4);
	
	
}
