#include <stdio.h>
#include <stdlib.h>


void sum_dig(int a[], int b[], int n) {
	int i;
	int c[n+1];//πίνακας αποτελεσματος, προσθέτομε αλλο ενα κελί στην 
			   //αρχή για τυχόν κρατούμενο
	c[0]=0;    //αρχικοποίηση κρατούμενου
	int sum,kratoum=0;
	for(i=n-1;i>=0;--i){
		sum=a[i]+b[i]+kratoum;   // προσθέτουμε τα ψηφία ανα 2 + οτι κρατούμενο υπάρχει (αν υπάρχει)
		c[i+1]=sum%2;            //αυτό που μένει, πχ 1+1=0 (ή 2 %2), 1+1+1=1 και 1 κρατούμενο (ή 3%2)
		kratoum=sum/2;           //ακέραια διαιρεση με 2, ότι περισσέυει γίνεται κρατούμενο
		
	}
	//αν έχουντας τελειώσει την πρόσθεση υπάρχει κρατούμενο, το προσθέτουμε μπροστά
	if (kratoum==1){
		c[0]=1;
	}
	

	puts("\nΑποτέλεσμα: ");
	
	for(i=0;i<n+1;++i){
		printf("%d ",c[i]);
	}
	
	
	
}
	


int main(void){
	
	system("chcp 1253>nul");
	int a[4]={1,0,1,0};
	int b[4]={0,1,1,1};
	int i;
	puts("Αριθμοί: ");
	printf("  ");
	for(i=0;i<4;++i){
		printf("%d ",a[i]);
	}
	printf("\n+\n");
	printf("  ");
	for(i=0;i<4;++i){
		printf("%d ",b[i]);
	}
	
	sum_dig(a,b,4);
	
	
}
